MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_gpio.h
  * @brief   Header file of GPIO HAL module.
  **********************************************************************************************************************
    * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_GPIO_H
#define STM32C5XX_HAL_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_gpio.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (GPIOA) || defined (GPIOB) || defined (GPIOC) || defined (GPIOD) || defined (GPIOE) \
    || defined (GPIOF) ||  defined (GPIOG) || defined (GPIOH)

/** @defgroup GPIO GPIO
  * @{
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/

/** @defgroup GPIO_Exported_Types HAL GPIO Types
  * @{
  */

/**
  * @brief HAL GPIO instance
  */
typedef enum
{
  HAL_GPIOA = GPIOA_BASE,     /*!< GPIO port A. */
  HAL_GPIOB = GPIOB_BASE,     /*!< GPIO port B. */
  HAL_GPIOC = GPIOC_BASE,     /*!< GPIO port C. */
  HAL_GPIOD = GPIOD_BASE,     /*!< GPIO port D. */
  HAL_GPIOE = GPIOE_BASE,     /*!< GPIO port E. */
#if defined(GPIOF) && defined(GPIOG)
  HAL_GPIOF = GPIOF_BASE,     /*!< GPIO port F. */
  HAL_GPIOG = GPIOG_BASE,     /*!< GPIO port G. */
#endif /* GPIOF && GPIOG */
  HAL_GPIOH = GPIOH_BASE,     /*!< GPIO port H. */
} hal_gpio_t;

/**
  * @brief HAL GPIO mode
  */
typedef enum
{
  HAL_GPIO_MODE_INPUT     =  LL_GPIO_MODE_INPUT,      /*!< Input Floating mode. */
  HAL_GPIO_MODE_OUTPUT    =  LL_GPIO_MODE_OUTPUT,     /*!< Output mode.         */
  HAL_GPIO_MODE_ALTERNATE =  LL_GPIO_MODE_ALTERNATE,  /*!< Alternate mode.      */
  HAL_GPIO_MODE_ANALOG    =  LL_GPIO_MODE_ANALOG      /*!< Analog mode.         */
} hal_gpio_mode_t;

/**
  * @brief HAL GPIO Output Type.
  */
typedef enum
{
  HAL_GPIO_OUTPUT_PUSHPULL  = LL_GPIO_OUTPUT_PUSHPULL,   /*!< Select push-pull as output type.  */
  HAL_GPIO_OUTPUT_OPENDRAIN = LL_GPIO_OUTPUT_OPENDRAIN   /*!< Select open-drain as output type. */
} hal_gpio_output_t;

/**
  * @brief HAL GPIO speed.
  * @note  Refer to the device datasheet for the frequency specifications, and the power supply and load conditions
  *        for each speed.
  */
typedef enum
{
  HAL_GPIO_SPEED_FREQ_LOW        = LL_GPIO_SPEED_FREQ_LOW,        /*!< Low speed.       */
  HAL_GPIO_SPEED_FREQ_MEDIUM     = LL_GPIO_SPEED_FREQ_MEDIUM,     /*!< Medium speed.    */
  HAL_GPIO_SPEED_FREQ_HIGH       = LL_GPIO_SPEED_FREQ_HIGH,       /*!< High speed.      */
  HAL_GPIO_SPEED_FREQ_VERY_HIGH  = LL_GPIO_SPEED_FREQ_VERY_HIGH   /*!< Very-high speed. */
} hal_gpio_speed_freq_t;

/**
  * @brief HAL GPIO pull
  */
typedef enum
{
  HAL_GPIO_PULL_NO   = LL_GPIO_PULL_NO,   /*!< No Pull-up or Pull-down activation.  */
  HAL_GPIO_PULL_UP   = LL_GPIO_PULL_UP,   /*!< Pull-up activation.                  */
  HAL_GPIO_PULL_DOWN = LL_GPIO_PULL_DOWN  /*!< Pull-down activation.                */
} hal_gpio_pull_t;

/**
  * @brief HAL GPIO Alternate function.
  */
typedef enum
{
  HAL_GPIO_AF_0  = LL_GPIO_AF_0,  /*!< Select alternate function 0.  */
  HAL_GPIO_AF_1  = LL_GPIO_AF_1,  /*!< Select alternate function 1.  */
  HAL_GPIO_AF_2  = LL_GPIO_AF_2,  /*!< Select alternate function 2.  */
  HAL_GPIO_AF_3  = LL_GPIO_AF_3,  /*!< Select alternate function 3.  */
  HAL_GPIO_AF_4  = LL_GPIO_AF_4,  /*!< Select alternate function 4.  */
  HAL_GPIO_AF_5  = LL_GPIO_AF_5,  /*!< Select alternate function 5.  */
  HAL_GPIO_AF_6  = LL_GPIO_AF_6,  /*!< Select alternate function 6.  */
  HAL_GPIO_AF_7  = LL_GPIO_AF_7,  /*!< Select alternate function 7.  */
  HAL_GPIO_AF_8  = LL_GPIO_AF_8,  /*!< Select alternate function 8.  */
  HAL_GPIO_AF_9  = LL_GPIO_AF_9,  /*!< Select alternate function 9.  */
  HAL_GPIO_AF_10 = LL_GPIO_AF_10, /*!< Select alternate function 10. */
  HAL_GPIO_AF_11 = LL_GPIO_AF_11, /*!< Select alternate function 11. */
  HAL_GPIO_AF_12 = LL_GPIO_AF_12, /*!< Select alternate function 12. */
  HAL_GPIO_AF_13 = LL_GPIO_AF_13, /*!< Select alternate function 13. */
  HAL_GPIO_AF_14 = LL_GPIO_AF_14, /*!< Select alternate function 14. */
  HAL_GPIO_AF_15 = LL_GPIO_AF_15  /*!< Select alternate function 15. */
} hal_gpio_af_t;

/**
  * @brief  GPIO Bit SET and Bit RESET enumeration.
  */
typedef enum
{
  HAL_GPIO_PIN_RESET = LL_GPIO_PIN_RESET,  /*!< Pin state is reset/low. */
  HAL_GPIO_PIN_SET   = LL_GPIO_PIN_SET     /*!< Pin state is set/high.  */
} hal_gpio_pin_state_t;

/**
  * @brief   GPIO Init structure definition.
  */
typedef struct
{
  hal_gpio_mode_t       mode;            /*!< Specifies the operating mode for the selected pins. */
  hal_gpio_pull_t       pull;            /*!< Specifies the Pull-up or Pull-Down activation for the selected pins. */
  hal_gpio_speed_freq_t speed;           /*!< Specifies the speed for the selected pins. */
  hal_gpio_output_t     output_type;     /*!< Specifies the operating output type for the selected pins. */
  hal_gpio_af_t         alternate;       /*!< Specifies the alternate function for the selected pins. */
  hal_gpio_pin_state_t  init_state;      /*!< Specifies the initial state Set or Reset for the selected pins. */
} hal_gpio_config_t;

/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Exported_Constants HAL GPIO Constants
  * @{
  */

/** @defgroup GPIO_pins GPIO pins
  * @{
  */

