MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.h
/**
  * @brief   AF 7 selection
  */
#define HAL_GPIO_AF7_I2S2                HAL_GPIO_AF_7 /*!< I2S2 Alternate Function mapping        */
#define HAL_GPIO_AF7_I2S2_SDO            HAL_GPIO_AF_7 /*!< I2S2 Serial Data Output                */
#define HAL_GPIO_AF7_I2S2_WS             HAL_GPIO_AF_7 /*!< I2S2 Word Select                       */
#define HAL_GPIO_AF7_I2S3                HAL_GPIO_AF_7 /*!< I2S3 Alternate Function mapping        */
#define HAL_GPIO_AF7_I2S3_SDO            HAL_GPIO_AF_7 /*!< I2S3 Serial Data Output                */
#define HAL_GPIO_AF7_SPI2                HAL_GPIO_AF_7 /*!< SPI2 Alternate Function mapping        */
#define HAL_GPIO_AF7_SPI2_MOSI           HAL_GPIO_AF_7 /*!< SPI2 Master-Out/Slave-In               */
#define HAL_GPIO_AF7_SPI2_NSS            HAL_GPIO_AF_7 /*!< SPI2 Slave Selection                   */
#define HAL_GPIO_AF7_SPI2_RDY            HAL_GPIO_AF_7 /*!< SPI2 Master-In/Slave-Out FIFOs status  */
#define HAL_GPIO_AF7_SPI3                HAL_GPIO_AF_7 /*!< SPI3 Alternate Function mapping        */
#define HAL_GPIO_AF7_SPI3_MOSI           HAL_GPIO_AF_7 /*!< SPI3 Master-Out/Slave-In               */
#define HAL_GPIO_AF7_UART7               HAL_GPIO_AF_7 /*!< UART7 Alternate Function mapping       */
#define HAL_GPIO_AF7_UART7_CTS           HAL_GPIO_AF_7 /*!< UART7 Clear to send                    */
#define HAL_GPIO_AF7_UART7_RTS           HAL_GPIO_AF_7 /*!< UART7 Request to send/Driver enable    */
#define HAL_GPIO_AF7_UART7_RX            HAL_GPIO_AF_7 /*!< UART7 Serial Data Receive Input        */
#define HAL_GPIO_AF7_UART7_TX            HAL_GPIO_AF_7 /*!< UART7 Transmit Data Output             */
#define HAL_GPIO_AF7_USART1              HAL_GPIO_AF_7 /*!< USART1 Alternate Function mapping      */
#define HAL_GPIO_AF7_USART1_CK           HAL_GPIO_AF_7 /*!< USART1 Clock                           */
#define HAL_GPIO_AF7_USART1_CTS          HAL_GPIO_AF_7 /*!< USART1 Clear to send                   */
#define HAL_GPIO_AF7_USART1_NSS          HAL_GPIO_AF_7 /*!< USART1 Slave Selection                 */
#define HAL_GPIO_AF7_USART1_RTS          HAL_GPIO_AF_7 /*!< USART1 Request to send                 */
#define HAL_GPIO_AF7_USART1_RTS_DE       HAL_GPIO_AF7_USART1_RTS /*!< Alias to USART1_RTS          */
#define HAL_GPIO_AF7_USART1_RX           HAL_GPIO_AF_7 /*!< USART1 Serial Data Receive Input       */
#define HAL_GPIO_AF7_USART1_TX           HAL_GPIO_AF_7 /*!< USART1 Transmit Data Output            */
#define HAL_GPIO_AF7_USART2              HAL_GPIO_AF_7 /*!< USART2 Alternate Function mapping      */
#define HAL_GPIO_AF7_USART2_CK           HAL_GPIO_AF_7 /*!< USART2 Clock                           */
#define HAL_GPIO_AF7_USART2_CTS          HAL_GPIO_AF_7 /*!< USART2 Clear to send                   */
#define HAL_GPIO_AF7_USART2_NSS          HAL_GPIO_AF_7 /*!< USART2 Slave Selection                 */
#define HAL_GPIO_AF7_USART2_RTS          HAL_GPIO_AF_7 /*!< USART2 Request to send                 */
#define HAL_GPIO_AF7_USART2_RTS_DE       HAL_GPIO_AF7_USART2_RTS /*!< Alias to USART2_RTS          */
#define HAL_GPIO_AF7_USART2_RX           HAL_GPIO_AF_7 /*!< USART2 Serial Data Receive Input       */
#define HAL_GPIO_AF7_USART2_TX           HAL_GPIO_AF_7 /*!< USART2 Transmit Data Output            */
#define HAL_GPIO_AF7_USART3              HAL_GPIO_AF_7 /*!< USART3 Alternate Function mapping      */
#define HAL_GPIO_AF7_USART3_CK           HAL_GPIO_AF_7 /*!< USART3 Clock                           */
#define HAL_GPIO_AF7_USART3_CTS          HAL_GPIO_AF_7 /*!< USART3 Clear to send                   */
#define HAL_GPIO_AF7_USART3_NSS          HAL_GPIO_AF_7 /*!< USART3 Slave Selection                 */
#define HAL_GPIO_AF7_USART3_RTS          HAL_GPIO_AF_7 /*!< USART3 Request to send                 */
#define HAL_GPIO_AF7_USART3_RTS_DE       HAL_GPIO_AF7_USART3_RTS /*!< Alias to USART3_RTS          */
#define HAL_GPIO_AF7_USART3_RX           HAL_GPIO_AF_7 /*!< USART3 Serial Data Receive Input       */
#define HAL_GPIO_AF7_USART3_TX           HAL_GPIO_AF_7 /*!< USART3 Transmit Data Output            */
#define HAL_GPIO_AF7_USART6              HAL_GPIO_AF_7 /*!< USART6 Alternate Function mapping      */
#define HAL_GPIO_AF7_USART6_CK           HAL_GPIO_AF_7 /*!< USART6 Clock                           */
#define HAL_GPIO_AF7_USART6_CTS          HAL_GPIO_AF_7 /*!< USART6 Clear to send                   */
#define HAL_GPIO_AF7_USART6_NSS          HAL_GPIO_AF_7 /*!< USART6 Slave Selection                 */
#define HAL_GPIO_AF7_USART6_RTS          HAL_GPIO_AF_7 /*!< USART6 Request to send                 */
#define HAL_GPIO_AF7_USART6_RX           HAL_GPIO_AF_7 /*!< USART6 Serial Data Receive Input       */
#define HAL_GPIO_AF7_USART6_TX           HAL_GPIO_AF_7 /*!< USART6 Transmit Data Output            */
#define HAL_GPIO_AF7_XSPI1               HAL_GPIO_AF_7 /*!< XSPI1 Alternate Function mapping       */
#define HAL_GPIO_AF7_XSPI1_IO0           HAL_GPIO_AF_7 /*!< XSPI1 Data pin 0                       */
#define HAL_GPIO_AF7_XSPI1_IO6           HAL_GPIO_AF_7 /*!< XSPI1 Data pin 6                       */

/**
  * @brief   AF 8 selection
  */
#define HAL_GPIO_AF8_I2C2                HAL_GPIO_AF_8 /*!< I2C2 Alternate Function mapping        */
#define HAL_GPIO_AF8_I2C2_SCL            HAL_GPIO_AF_8 /*!< I2C2 Clock                             */
#define HAL_GPIO_AF8_I2C2_SDA            HAL_GPIO_AF_8 /*!< I2C2 Data                              */
#define HAL_GPIO_AF8_LPUART1             HAL_GPIO_AF_8 /*!< LPUART1 Alternate Function mapping     */
#define HAL_GPIO_AF8_LPUART1_CTS         HAL_GPIO_AF_8 /*!< LPUART1 Clear to send                  */
#define HAL_GPIO_AF8_LPUART1_RTS         HAL_GPIO_AF_8 /*!< LPUART1 Request to send                */
#define HAL_GPIO_AF8_LPUART1_RTS_DE      HAL_GPIO_AF8_LPUART1_RTS /*!< Alias to LPUART1_RTS        */
#define HAL_GPIO_AF8_LPUART1_RX          HAL_GPIO_AF_8 /*!< LPUART1 Serial Data Receive Input      */
#define HAL_GPIO_AF8_LPUART1_TX          HAL_GPIO_AF_8 /*!< LPUART1 Transmit Data Output           */
#define HAL_GPIO_AF8_TIM5                HAL_GPIO_AF_8 /*!< TIM5 Alternate Function mapping        */
#define HAL_GPIO_AF8_TIM5_CH4            HAL_GPIO_AF_8 /*!< TIM5 Multi-purpose Channel 4           */
#define HAL_GPIO_AF8_TIM5_ETR            HAL_GPIO_AF_8 /*!< TIM5 External trigger input            */
#define HAL_GPIO_AF8_UART4               HAL_GPIO_AF_8 /*!< UART4 Alternate Function mapping       */
#define HAL_GPIO_AF8_UART4_CTS           HAL_GPIO_AF_8 /*!< UART4 Clear to send                    */
#define HAL_GPIO_AF8_UART4_RTS           HAL_GPIO_AF_8 /*!< UART4 Request to send                  */
#define HAL_GPIO_AF8_UART4_RTS_DE        HAL_GPIO_AF8_UART4_RTS /*!< Alias to UART4_RTS            */
#define HAL_GPIO_AF8_UART4_RX            HAL_GPIO_AF_8 /*!< UART4 Serial Data Receive Input        */
#define HAL_GPIO_AF8_UART4_TX            HAL_GPIO_AF_8 /*!< UART4 Transmit Data Output             */
#define HAL_GPIO_AF8_UART5               HAL_GPIO_AF_8 /*!< UART5 Alternate Function mapping       */
#define HAL_GPIO_AF8_UART5_CTS           HAL_GPIO_AF_8 /*!< UART5 Clear to send                    */
#define HAL_GPIO_AF8_UART5_RTS           HAL_GPIO_AF_8 /*!< UART5 Request to send                  */
#define HAL_GPIO_AF8_UART5_RTS_DE        HAL_GPIO_AF8_UART5_RTS /*!< Alias to UART5_RTS            */
#define HAL_GPIO_AF8_UART5_RX            HAL_GPIO_AF_8 /*!< UART5 Serial Data Receive Input        */
#define HAL_GPIO_AF8_UART5_TX            HAL_GPIO_AF_8 /*!< UART5 Transmit Data Output             */

/**
  * @brief   AF 9 selection
  */
#define HAL_GPIO_AF9_FDCAN1              HAL_GPIO_AF_9 /*!< FDCAN1 Alternate Function mapping      */
#define HAL_GPIO_AF9_FDCAN1_RX           HAL_GPIO_AF_9 /*!< FDCAN1 Receive pin                     */
#define HAL_GPIO_AF9_FDCAN1_TX           HAL_GPIO_AF_9 /*!< FDCAN1 Transmit pin                    */
#define HAL_GPIO_AF9_FDCAN2              HAL_GPIO_AF_9 /*!< FDCAN2 Alternate Function mapping      */
#define HAL_GPIO_AF9_FDCAN2_RX           HAL_GPIO_AF_9 /*!< FDCAN2 Receive pin                     */
#define HAL_GPIO_AF9_FDCAN2_TX           HAL_GPIO_AF_9 /*!< FDCAN2 Transmit pin                    */
#define HAL_GPIO_AF9_I2C1                HAL_GPIO_AF_9 /*!< I2C1 Alternate Function mapping        */
#define HAL_GPIO_AF9_I2C1_SCL            HAL_GPIO_AF_9 /*!< I2C1 Clock                             */
#define HAL_GPIO_AF9_I2C1_SDA            HAL_GPIO_AF_9 /*!< I2C1 Data                              */
#define HAL_GPIO_AF9_I2C1_SMBA           HAL_GPIO_AF_9 /*!< I2C1 SMBus Alert                       */
#define HAL_GPIO_AF9_I2C2                HAL_GPIO_AF_9 /*!< I2C2 Alternate Function mapping        */
#define HAL_GPIO_AF9_I2C2_SCL            HAL_GPIO_AF_9 /*!< I2C2 Clock                             */
#define HAL_GPIO_AF9_I2C2_SDA            HAL_GPIO_AF_9 /*!< I2C2 Data                              */
#define HAL_GPIO_AF9_I2S2                HAL_GPIO_AF_9 /*!< I2S2 Alternate Function mapping        */
#define HAL_GPIO_AF9_I2S2_WS             HAL_GPIO_AF_9 /*!< I2S2 Word Select                       */
#define HAL_GPIO_AF9_SPI2                HAL_GPIO_AF_9 /*!< SPI2 Alternate Function mapping        */
#define HAL_GPIO_AF9_SPI2_NSS            HAL_GPIO_AF_9 /*!< SPI2 Slave Selection                   */
#define HAL_GPIO_AF9_XSPI1               HAL_GPIO_AF_9 /*!< XSPI1 Alternate Function mapping       */
#define HAL_GPIO_AF9_XSPI1_CLK           HAL_GPIO_AF_9 /*!< XSPI1 Clock                            */
#define HAL_GPIO_AF9_XSPI1_IO0           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 0                       */
#define HAL_GPIO_AF9_XSPI1_IO1           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 1                       */
#define HAL_GPIO_AF9_XSPI1_IO2           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 2                       */
#define HAL_GPIO_AF9_XSPI1_IO3           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 3                       */
#define HAL_GPIO_AF9_XSPI1_IO4           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 4                       */
#define HAL_GPIO_AF9_XSPI1_IO5           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 5                       */
#define HAL_GPIO_AF9_XSPI1_IO6           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 6                       */
#define HAL_GPIO_AF9_XSPI1_IO7           HAL_GPIO_AF_9 /*!< XSPI1 Data pin 7                       */
#define HAL_GPIO_AF9_XSPI1_NCLK          HAL_GPIO_AF_9 /*!< XSPI1 Inverted Clock                   */
#define HAL_GPIO_AF9_XSPI1_NCS1          HAL_GPIO_AF_9 /*!< XSPI1 Memory Chip Select 1             */
#define HAL_GPIO_AF9_XSPI1_NCS2          HAL_GPIO_AF_9 /*!< XSPI1 Memory Chip Select 2             */

/**
  * @brief   AF 10 selection
  */
#define HAL_GPIO_AF10_CRS                HAL_GPIO_AF_10 /*!< CRS Alternate Function mapping        */
#define HAL_GPIO_AF10_CRS_SYNC           HAL_GPIO_AF_10 /*!< CRS synchronization                   */
#define HAL_GPIO_AF10_ETH1               HAL_GPIO_AF_10 /*!< ETH1 Alternate Function mapping       */
#define HAL_GPIO_AF10_ETH1_CLK           HAL_GPIO_AF_10 /*!< ETH1 Clock signal for synchronization */
#define HAL_GPIO_AF10_ETH1_MDC           HAL_GPIO_AF_10 /*!< ETH1 Management Data Clock            */
#define HAL_GPIO_AF10_ETH1_MDIO          HAL_GPIO_AF_10 /*!< ETH1 Management Data Input/Output     */
#define HAL_GPIO_AF10_ETH1_MII_COL       HAL_GPIO_AF_10 /*!< ETH1 Collision detect signal in MII   */
#define HAL_GPIO_AF10_ETH1_MII_CRS       HAL_GPIO_AF_10 /*!< ETH1 Carrier Sense signal in MII      */
#define HAL_GPIO_AF10_ETH1_MII_RX_CLK    HAL_GPIO_AF_10 /*!< ETH1 Receive clock signal in MII      */
#define HAL_GPIO_AF10_ETH1_MII_RX_DV     HAL_GPIO_AF_10 /*!< ETH1 Receive Data Valid signal in MII */
#define HAL_GPIO_AF10_ETH1_MII_RX_ER     HAL_GPIO_AF_10 /*!< ETH1 Receive Error signal in MII      */
#define HAL_GPIO_AF10_ETH1_MII_RXD0      HAL_GPIO_AF_10 /*!< ETH1 Receive Data bit 0 in MII        */
#define HAL_GPIO_AF10_ETH1_MII_RXD1      HAL_GPIO_AF_10 /*!< ETH1 Receive Data bit 1 in MII        */
#define HAL_GPIO_AF10_ETH1_MII_RXD2      HAL_GPIO_AF_10 /*!< ETH1 Receive Data bit 2 in MII        */
#define HAL_GPIO_AF10_ETH1_MII_RXD3      HAL_GPIO_AF_10 /*!< ETH1 Receive Data bit 3 in MII        */
#define HAL_GPIO_AF10_ETH1_MII_TX_CLK    HAL_GPIO_AF_10 /*!< ETH1 Transmit clock signal in MII     */
#define HAL_GPIO_AF10_ETH1_MII_TX_EN     HAL_GPIO_AF_10 /*!< ETH1 Transmit Enable signal in MII    */
#define HAL_GPIO_AF10_ETH1_MII_TX_ER     HAL_GPIO_AF_10 /*!< ETH1 Transmit Error signal in MII     */
#define HAL_GPIO_AF10_ETH1_MII_TXD0      HAL_GPIO_AF_10 /*!< ETH1 Transmit Data bit 0 in MII       */
#define HAL_GPIO_AF10_ETH1_MII_TXD1      HAL_GPIO_AF_10 /*!< ETH1 Transmit Data bit 1 in MII       */
#define HAL_GPIO_AF10_ETH1_MII_TXD2      HAL_GPIO_AF_10 /*!< ETH1 Transmit Data bit 2 in MII       */
#define HAL_GPIO_AF10_ETH1_MII_TXD3      HAL_GPIO_AF_10 /*!< ETH1 Transmit Data bit 3 in MII       */
#define HAL_GPIO_AF10_ETH1_PHY_INTN      HAL_GPIO_AF_10 /*!< ETH1 Interrupt signal from PHY        */
#define HAL_GPIO_AF10_ETH1_PPS_OUT       HAL_GPIO_AF_10 /*!< ETH1 Pulse Per Second output          */
#define HAL_GPIO_AF10_ETH1_PTP_AUX_TS    HAL_GPIO_AF_10 /*!< ETH1 Auxiliary timestamp              */
#define HAL_GPIO_AF10_ETH1_RMII_CRS_DV   HAL_GPIO_AF_10 /*!< ETH1 Carrier Sense and Data Valid     */
#define HAL_GPIO_AF10_ETH1_RMII_REF_CLK  HAL_GPIO_AF_10 /*!< ETH1 Reference clock signal in RMII   */
#define HAL_GPIO_AF10_ETH1_RMII_RXD0     HAL_GPIO_AF_10 /*!< ETH1 Receive Data bit 0 in RMII       */
#define HAL_GPIO_AF10_ETH1_RMII_RXD1     HAL_GPIO_AF_10 /*!< ETH1 Receive Data bit 1 in RMII       */
#define HAL_GPIO_AF10_ETH1_RMII_TX_EN    HAL_GPIO_AF_10 /*!< ETH1 Transmit Enable signal in RMII   */
#define HAL_GPIO_AF10_ETH1_RMII_TXD0     HAL_GPIO_AF_10 /*!< ETH1 Transmit Data bit 0 in RMII      */
#define HAL_GPIO_AF10_ETH1_RMII_TXD1     HAL_GPIO_AF_10 /*!< ETH1 Transmit Data bit 1 in RMII      */
#define HAL_GPIO_AF10_TIM16              HAL_GPIO_AF_10 /*!< TIM16 Alternate Function mapping      */
#define HAL_GPIO_AF10_TIM16_BKIN         HAL_GPIO_AF_10 /*!< TIM16 Break input                     */
#define HAL_GPIO_AF10_TIM16_CH1          HAL_GPIO_AF_10 /*!< TIM16 Multi-purpose Channel 1         */
#define HAL_GPIO_AF10_TIM16_CH1N         HAL_GPIO_AF_10 /*!< TIM16 CH1 complementary output        */
#define HAL_GPIO_AF10_UART7              HAL_GPIO_AF_10 /*!< UART7 Alternate Function mapping      */
#define HAL_GPIO_AF10_UART7_RX           HAL_GPIO_AF_10 /*!< UART7 Serial Data Receive Input       */
#define HAL_GPIO_AF10_UART7_TX           HAL_GPIO_AF_10 /*!< UART7 Transmit Data Output            */

/**
  * @brief   AF 11 selection
  */
#define HAL_GPIO_AF11_USART1             HAL_GPIO_AF_11 /*!< USART1 Alternate Function mapping     */
#define HAL_GPIO_AF11_USART1_TX          HAL_GPIO_AF_11 /*!< USART1 Transmit Data Output           */
#define HAL_GPIO_AF11_USART3             HAL_GPIO_AF_11 /*!< USART3 Alternate Function mapping     */
#define HAL_GPIO_AF11_USART3_CK          HAL_GPIO_AF_11 /*!< USART3 Clock                          */
#define HAL_GPIO_AF11_USART3_CTS         HAL_GPIO_AF_11 /*!< USART3 Clear to send                  */
#define HAL_GPIO_AF11_USART3_NSS         HAL_GPIO_AF_11 /*!< USART3 Slave Selection                */
#define HAL_GPIO_AF11_USART3_RTS         HAL_GPIO_AF_11 /*!< USART3 Request to send                */
#define HAL_GPIO_AF11_USART3_RTS_DE      HAL_GPIO_AF11_USART3_RTS /*!< Alias to USART3_RTS         */
#define HAL_GPIO_AF11_USART3_RX          HAL_GPIO_AF_11 /*!< USART3 Serial Data Receive Input      */
#define HAL_GPIO_AF11_USART3_TX          HAL_GPIO_AF_11 /*!< USART3 Transmit Data Output           */
#define HAL_GPIO_AF11_XSPI1              HAL_GPIO_AF_11 /*!< XSPI1 Alternate Function mapping      */
#define HAL_GPIO_AF11_XSPI1_CLK          HAL_GPIO_AF_11 /*!< XSPI1 Clock                           */
#define HAL_GPIO_AF11_XSPI1_DQS          HAL_GPIO_AF_11 /*!< XSPI1 Memory Data Strobe I/O          */
#define HAL_GPIO_AF11_XSPI1_IO0          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 0                      */
#define HAL_GPIO_AF11_XSPI1_IO1          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 1                      */
#define HAL_GPIO_AF11_XSPI1_IO2          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 2                      */
#define HAL_GPIO_AF11_XSPI1_IO3          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 3                      */
#define HAL_GPIO_AF11_XSPI1_IO4          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 4                      */
#define HAL_GPIO_AF11_XSPI1_IO5          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 5                      */
#define HAL_GPIO_AF11_XSPI1_IO6          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 6                      */
#define HAL_GPIO_AF11_XSPI1_IO7          HAL_GPIO_AF_11 /*!< XSPI1 Data pin 7                      */
#define HAL_GPIO_AF11_XSPI1_NCLK         HAL_GPIO_AF_11 /*!< XSPI1 Inverted Clock                  */
#define HAL_GPIO_AF11_XSPI1_NCS1         HAL_GPIO_AF_11 /*!< XSPI1 Memory Chip Select 1            */
#define HAL_GPIO_AF11_XSPI1_NCS2         HAL_GPIO_AF_11 /*!< XSPI1 Memory Chip Select 2            */

/**
  * @brief   AF 12 selection
  */
#define HAL_GPIO_AF12_ETH1               HAL_GPIO_AF_12 /*!< ETH1 Alternate Function mapping       */
#define HAL_GPIO_AF12_ETH1_MDC           HAL_GPIO_AF_12 /*!< ETH1 Management Data Clock            */
#define HAL_GPIO_AF12_ETH1_MDIO          HAL_GPIO_AF_12 /*!< ETH1 Management Data Input/Output     */
#define HAL_GPIO_AF12_ETH1_MII_RXD0      HAL_GPIO_AF_12 /*!< ETH1 Receive Data bit 0 in MII        */
#define HAL_GPIO_AF12_ETH1_MII_TX_ER     HAL_GPIO_AF_12 /*!< ETH1 Transmit Error signal in MII     */
#define HAL_GPIO_AF12_ETH1_RMII_RXD0     HAL_GPIO_AF_12 /*!< ETH1 Receive Data bit 0 in RMII       */

/**
  * @brief   AF 13 selection
  */
#define HAL_GPIO_AF13_ETH1               HAL_GPIO_AF_13 /*!< ETH1 Alternate Function mapping       */
#define HAL_GPIO_AF13_ETH1_CLK           HAL_GPIO_AF_13 /*!< ETH1 Clock signal for synchronization */
#define HAL_GPIO_AF13_ETH1_MII_RX_ER     HAL_GPIO_AF_13 /*!< ETH1 Receive Error signal in MII      */
#define HAL_GPIO_AF13_ETH1_MII_RXD0      HAL_GPIO_AF_13 /*!< ETH1 Receive Data bit 0 in MII        */
#define HAL_GPIO_AF13_ETH1_MII_RXD1      HAL_GPIO_AF_13 /*!< ETH1 Receive Data bit 1 in MII        */
#define HAL_GPIO_AF13_ETH1_MII_TX_ER     HAL_GPIO_AF_13 /*!< ETH1 Transmit Error signal in MII     */
#define HAL_GPIO_AF13_ETH1_RMII_RXD0     HAL_GPIO_AF_13 /*!< ETH1 Receive Data bit 0 in RMII       */
#define HAL_GPIO_AF13_ETH1_RMII_RXD1     HAL_GPIO_AF_13 /*!< ETH1 Receive Data bit 1 in RMII       */
#define HAL_GPIO_AF13_TIM8               HAL_GPIO_AF_13 /*!< TIM8 Alternate Function mapping       */
#define HAL_GPIO_AF13_TIM8_CH1           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 1          */
#define HAL_GPIO_AF13_TIM8_CH2           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 2          */
#define HAL_GPIO_AF13_TIM8_CH2N          HAL_GPIO_AF_13 /*!< TIM8 CH2 complementary output         */
#define HAL_GPIO_AF13_TIM8_CH3           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 3          */
#define HAL_GPIO_AF13_TIM8_CH4           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 4          */
#define HAL_GPIO_AF13_TIM8_CH4N          HAL_GPIO_AF_13 /*!< TIM8 CH4 complementary output         */
#define HAL_GPIO_AF13_USB                HAL_GPIO_AF_13 /*!< USB Alternate Function mapping        */
#define HAL_GPIO_AF13_USB_SOF            HAL_GPIO_AF_13 /*!< USB Start of Frame                    */

/**
  * @brief   AF 14 selection
  */
#define HAL_GPIO_AF14_COMP1              HAL_GPIO_AF_14 /*!< COMP1 Alternate Function mapping     */
#define HAL_GPIO_AF14_COMP1_OUT          HAL_GPIO_AF_14 /*!< COMP1 Output channel                 */
#define HAL_GPIO_AF14_TIM2               HAL_GPIO_AF_14 /*!< TIM2 Alternate Function mapping      */
#define HAL_GPIO_AF14_TIM2_CH4           HAL_GPIO_AF_14 /*!< TIM2 Multi-purpose Channel 4         */
#define HAL_GPIO_AF14_TIM2_ETR           HAL_GPIO_AF_14 /*!< TIM2 External trigger input          */
#define HAL_GPIO_AF14_UART5              HAL_GPIO_AF_14 /*!< UART5 Alternate Function mapping     */
#define HAL_GPIO_AF14_UART5_CTS          HAL_GPIO_AF_14 /*!< UART5 Clear to send                  */
#define HAL_GPIO_AF14_UART5_RTS          HAL_GPIO_AF_14 /*!< UART5 Request to send                */
#define HAL_GPIO_AF14_UART5_RTS_DE       HAL_GPIO_AF14_UART5_RTS /*!< Alias to UART5_RTS          */
#define HAL_GPIO_AF14_UART5_RX           HAL_GPIO_AF_14 /*!< UART5 Serial Data Receive Input      */
#define HAL_GPIO_AF14_UART5_TX           HAL_GPIO_AF_14 /*!< UART5 Transmit Data Output           */

/**
  * @brief   AF 15 selection
  */
#define HAL_GPIO_AF15_EVENTOUT           HAL_GPIO_AF_15 /*!< EVENTOUT Alternate Function mapping  */
#endif /* STM32C591xx || STM32C593xx || STM32C5A3xx */
#if (defined (STM32C551xx) || defined (STM32C552xx) || defined (STM32C562xx))
/**
  * @brief   AF 0 selection
  */
#define HAL_GPIO_AF0_SWJ                 HAL_GPIO_AF_0 /*!< SWJ (SWD and JTAG)                     */
#define HAL_GPIO_AF0_JTCK                HAL_GPIO_AF_0 /*!< JTAG Test Clock                        */
#define HAL_GPIO_AF0_JTDI                HAL_GPIO_AF_0 /*!< JTAG Test Data In                      */
#define HAL_GPIO_AF0_JTDO                HAL_GPIO_AF_0 /*!< JTAG Test Data Out                     */
#define HAL_GPIO_AF0_JTMS                HAL_GPIO_AF_0 /*!< JTAG Test Mode Select                  */
#define HAL_GPIO_AF0_MCO                 HAL_GPIO_AF_0 /*!< MCO Alternate Function mapping         */
#define HAL_GPIO_AF0_MCO1                HAL_GPIO_AF_0 /*!< MCO1                                   */
#define HAL_GPIO_AF0_MCO2                HAL_GPIO_AF_0 /*!< MCO2                                   */
#define HAL_GPIO_AF0_NJTRST              HAL_GPIO_AF_0 /*!< NJTRST                                 */
#define HAL_GPIO_AF0_PWR                 HAL_GPIO_AF_0 /*!< PWR Alternate Function mapping         */
#define HAL_GPIO_AF0_PWR_CSLEEP          HAL_GPIO_AF_0 /*!< PWR CSLEEP mode                        */
#define HAL_GPIO_AF0_CSLEEP              HAL_GPIO_AF0_PWR_CSLEEP /*!< Alias to PWR_CSLEEP          */
#define HAL_GPIO_AF0_PWR_CSTOP           HAL_GPIO_AF_0 /*!< PWR CSTOP mode                         */
#define HAL_GPIO_AF0_CSTOP               HAL_GPIO_AF0_PWR_CSTOP /*!< Alias to PWR_CSTOP            */
#define HAL_GPIO_AF0_RTC                 HAL_GPIO_AF_0 /*!< RTC Alternate Function mapping         */
#define HAL_GPIO_AF0_RTC_OUT2            HAL_GPIO_AF_0 /*!< RTC Output 2                           */
#define HAL_GPIO_AF0_RTC_REFIN           HAL_GPIO_AF_0 /*!< RTC Reference input                    */
#define HAL_GPIO_AF0_SWCLK               HAL_GPIO_AF_0 /*!< Serial Wire Clock                      */
#define HAL_GPIO_AF0_SWDIO               HAL_GPIO_AF_0 /*!< Serial Wire Debug Input/Output         */
#define HAL_GPIO_AF0_TRACECLK            HAL_GPIO_AF_0 /*!< TRACE Clock                            */
#define HAL_GPIO_AF0_TRACED0             HAL_GPIO_AF_0 /*!< TRACE Data Output 0                    */
#define HAL_GPIO_AF0_TRACED1             HAL_GPIO_AF_0 /*!< TRACE Data Output 1                    */
#define HAL_GPIO_AF0_TRACED2             HAL_GPIO_AF_0 /*!< TRACE Data Output 2                    */
#define HAL_GPIO_AF0_TRACED3             HAL_GPIO_AF_0 /*!< TRACE Data Output 3                    */
#define HAL_GPIO_AF0_TRACESWO            HAL_GPIO_AF_0 /*!< TRACE Serial Wire Output               */

