MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.h
/**
  * @brief   AF 1 selection
  */
#define HAL_GPIO_AF1_LPTIM1              HAL_GPIO_AF_1 /*!< LPTIM1 Alternate Function mapping     */
#define HAL_GPIO_AF1_LPTIM1_CH1          HAL_GPIO_AF_1 /*!< LPTIM1 Multi-purpose Channel 1        */
#define HAL_GPIO_AF1_LPTIM1_CH2          HAL_GPIO_AF_1 /*!< LPTIM1 Multi-purpose Channel 2        */
#define HAL_GPIO_AF1_LPTIM1_ETR          HAL_GPIO_AF_1 /*!< LPTIM1 External trigger input         */
#define HAL_GPIO_AF1_LPTIM1_IN1          HAL_GPIO_AF_1 /*!< LPTIM1 Channel 1 Input                */
#define HAL_GPIO_AF1_LPTIM1_IN2          HAL_GPIO_AF_1 /*!< LPTIM1 Channel 2 Input                */
#define HAL_GPIO_AF1_TIM1                HAL_GPIO_AF_1 /*!< TIM1 Alternate Function mapping       */
#define HAL_GPIO_AF1_TIM1_BKIN           HAL_GPIO_AF_1 /*!< TIM1 Break input                      */
#define HAL_GPIO_AF1_TIM1_BKIN2          HAL_GPIO_AF_1 /*!< TIM1 Break input 2                    */
#define HAL_GPIO_AF1_TIM1_CH1            HAL_GPIO_AF_1 /*!< TIM1 Multi-purpose Channel 1          */
#define HAL_GPIO_AF1_TIM1_CH1N           HAL_GPIO_AF_1 /*!< TIM1 CH1 complementary output         */
#define HAL_GPIO_AF1_TIM1_CH2            HAL_GPIO_AF_1 /*!< TIM1 Multi-purpose Channel 2          */
#define HAL_GPIO_AF1_TIM1_CH2N           HAL_GPIO_AF_1 /*!< TIM1 CH2 complementary output         */
#define HAL_GPIO_AF1_TIM1_CH3            HAL_GPIO_AF_1 /*!< TIM1 Multi-purpose Channel 3          */
#define HAL_GPIO_AF1_TIM1_CH3N           HAL_GPIO_AF_1 /*!< TIM1 CH3 complementary output         */
#define HAL_GPIO_AF1_TIM1_CH4            HAL_GPIO_AF_1 /*!< TIM1 Multi-purpose Channel 4          */
#define HAL_GPIO_AF1_TIM1_CH4N           HAL_GPIO_AF_1 /*!< TIM1 CH4 complementary output         */
#define HAL_GPIO_AF1_TIM1_ETR            HAL_GPIO_AF_1 /*!< TIM1 External trigger input           */
#define HAL_GPIO_AF1_TIM2                HAL_GPIO_AF_1 /*!< TIM2 Alternate Function mapping       */
#define HAL_GPIO_AF1_TIM2_CH1            HAL_GPIO_AF_1 /*!< TIM2 Multi-purpose Channel 1          */
#define HAL_GPIO_AF1_TIM2_CH2            HAL_GPIO_AF_1 /*!< TIM2 Multi-purpose Channel 2          */
#define HAL_GPIO_AF1_TIM2_CH3            HAL_GPIO_AF_1 /*!< TIM2 Multi-purpose Channel 3          */
#define HAL_GPIO_AF1_TIM2_CH4            HAL_GPIO_AF_1 /*!< TIM2 Multi-purpose Channel 4          */
#define HAL_GPIO_AF1_TIM17               HAL_GPIO_AF_1 /*!< TIM17 Alternate Function mapping      */
#define HAL_GPIO_AF1_TIM17_BKIN          HAL_GPIO_AF_1 /*!< TIM17 Break input                     */
#define HAL_GPIO_AF1_TIM17_CH1           HAL_GPIO_AF_1 /*!< TIM17 Multi-purpose Channel 1         */
#define HAL_GPIO_AF1_TIM17_CH1N          HAL_GPIO_AF_1 /*!< TIM17 CH1 complementary output        */

/**
  * @brief   AF 2 selection
  */
#define HAL_GPIO_AF2_I3C1                HAL_GPIO_AF_2 /*!< I3C1 Alternate Function mapping       */
#define HAL_GPIO_AF2_I3C1_SCL            HAL_GPIO_AF_2 /*!< I3C1 Clock                            */
#define HAL_GPIO_AF2_I3C1_SDA            HAL_GPIO_AF_2 /*!< I3C1 Data                             */
#define HAL_GPIO_AF2_TIM1                HAL_GPIO_AF_2 /*!< TIM1 Alternate Function mapping       */
#define HAL_GPIO_AF2_TIM1_CH2N           HAL_GPIO_AF_2 /*!< TIM1 CH2 complementary output         */
#define HAL_GPIO_AF2_TIM1_CH3            HAL_GPIO_AF_2 /*!< TIM1 Multi-purpose Channel 3          */
#define HAL_GPIO_AF2_TIM5                HAL_GPIO_AF_2 /*!< TIM5 Alternate Function mapping       */
#define HAL_GPIO_AF2_TIM5_CH1            HAL_GPIO_AF_2 /*!< TIM5 Multi-purpose Channel 1          */
#define HAL_GPIO_AF2_TIM5_CH2            HAL_GPIO_AF_2 /*!< TIM5 Multi-purpose Channel 2          */
#define HAL_GPIO_AF2_TIM5_CH3            HAL_GPIO_AF_2 /*!< TIM5 Multi-purpose Channel 3          */
#define HAL_GPIO_AF2_TIM5_CH4            HAL_GPIO_AF_2 /*!< TIM5 Multi-purpose Channel 4          */
#define HAL_GPIO_AF2_TIM5_ETR            HAL_GPIO_AF_2 /*!< TIM5 External trigger input           */
#define HAL_GPIO_AF2_TIM8                HAL_GPIO_AF_2 /*!< TIM8 Alternate Function mapping       */
#define HAL_GPIO_AF2_TIM8_CH1            HAL_GPIO_AF_2 /*!< TIM8 Multi-purpose Channel 1          */
#define HAL_GPIO_AF2_TIM8_CH2            HAL_GPIO_AF_2 /*!< TIM8 Multi-purpose Channel 2          */
#define HAL_GPIO_AF2_TIM8_CH3            HAL_GPIO_AF_2 /*!< TIM8 Multi-purpose Channel 3          */
#define HAL_GPIO_AF2_TIM12               HAL_GPIO_AF_2 /*!< TIM12 Alternate Function mapping      */
#define HAL_GPIO_AF2_TIM12_CH1           HAL_GPIO_AF_2 /*!< TIM12 Multi-purpose Channel 1         */
#define HAL_GPIO_AF2_TIM12_CH2           HAL_GPIO_AF_2 /*!< TIM12 Multi-purpose Channel 2         */
#define HAL_GPIO_AF2_TIM15               HAL_GPIO_AF_2 /*!< TIM15 Alternate Function mapping      */
#define HAL_GPIO_AF2_TIM15_CH1           HAL_GPIO_AF_2 /*!< TIM15 Multi-purpose Channel 1         */

/**
  * @brief   AF 3 selection
  */
#define HAL_GPIO_AF3_I3C1                HAL_GPIO_AF_3 /*!< I3C1 Alternate Function mapping       */
#define HAL_GPIO_AF3_I3C1_SCL            HAL_GPIO_AF_3 /*!< I3C1 Clock                            */
#define HAL_GPIO_AF3_I3C1_SDA            HAL_GPIO_AF_3 /*!< I3C1 Data                             */
#define HAL_GPIO_AF3_LPTIM1              HAL_GPIO_AF_3 /*!< LPTIM1 Alternate Function mapping     */
#define HAL_GPIO_AF3_LPTIM1_CH1          HAL_GPIO_AF_3 /*!< LPTIM1 Multi-purpose Channel 1        */
#define HAL_GPIO_AF3_LPTIM1_ETR          HAL_GPIO_AF_3 /*!< LPTIM1 External trigger input         */
#define HAL_GPIO_AF3_LPTIM1_IN1          HAL_GPIO_AF_3 /*!< LPTIM1 Channel 1 Input                */
#define HAL_GPIO_AF3_LPTIM1_IN2          HAL_GPIO_AF_3 /*!< LPTIM1 Channel 2 Input                */
#define HAL_GPIO_AF3_LPUART1             HAL_GPIO_AF_3 /*!< LPUART1 Alternate Function mapping    */
#define HAL_GPIO_AF3_LPUART1_CTS         HAL_GPIO_AF_3 /*!< LPUART1 Clear to send                 */
#define HAL_GPIO_AF3_LPUART1_RTS         HAL_GPIO_AF_3 /*!< LPUART1 Request to send               */
#define HAL_GPIO_AF3_LPUART1_RTS_DE      HAL_GPIO_AF3_LPUART1_RTS /*!< Alias to LPUART1_RTS        */
#define HAL_GPIO_AF3_LPUART1_RX          HAL_GPIO_AF_3 /*!< LPUART1 Serial Data Receive Input     */
#define HAL_GPIO_AF3_LPUART1_TX          HAL_GPIO_AF_3 /*!< LPUART1 Transmit Data Output          */
#define HAL_GPIO_AF3_TIM1                HAL_GPIO_AF_3 /*!< TIM1 Alternate Function mapping       */
#define HAL_GPIO_AF3_TIM1_CH4N           HAL_GPIO_AF_3 /*!< TIM1 CH4 complementary output         */
#define HAL_GPIO_AF3_TIM5                HAL_GPIO_AF_3 /*!< TIM5 Alternate Function mapping       */
#define HAL_GPIO_AF3_TIM5_CH3            HAL_GPIO_AF_3 /*!< TIM5 Multi-purpose Channel 3          */
#define HAL_GPIO_AF3_TIM8                HAL_GPIO_AF_3 /*!< TIM8 Alternate Function mapping       */
#define HAL_GPIO_AF3_TIM8_BKIN           HAL_GPIO_AF_3 /*!< TIM8 Break input                      */
#define HAL_GPIO_AF3_TIM8_BKIN2          HAL_GPIO_AF_3 /*!< TIM8 Break input 2                    */
#define HAL_GPIO_AF3_TIM8_CH1            HAL_GPIO_AF_3 /*!< TIM8 Multi-purpose Channel 1          */
#define HAL_GPIO_AF3_TIM8_CH1N           HAL_GPIO_AF_3 /*!< TIM8 CH1 complementary output         */
#define HAL_GPIO_AF3_TIM8_CH2            HAL_GPIO_AF_3 /*!< TIM8 Multi-purpose Channel 2          */
#define HAL_GPIO_AF3_TIM8_CH2N           HAL_GPIO_AF_3 /*!< TIM8 CH2 complementary output         */
#define HAL_GPIO_AF3_TIM8_CH3            HAL_GPIO_AF_3 /*!< TIM8 Multi-purpose Channel 3          */
#define HAL_GPIO_AF3_TIM8_CH3N           HAL_GPIO_AF_3 /*!< TIM8 CH3 complementary output         */
#define HAL_GPIO_AF3_TIM8_CH4            HAL_GPIO_AF_3 /*!< TIM8 Multi-purpose Channel 4          */
#define HAL_GPIO_AF3_TIM8_CH4N           HAL_GPIO_AF_3 /*!< TIM8 CH4 complementary output         */
#define HAL_GPIO_AF3_TIM8_ETR            HAL_GPIO_AF_3 /*!< TIM8 External trigger input           */

/**
  * @brief   AF 4 selection
  */
#define HAL_GPIO_AF4_I2C1                HAL_GPIO_AF_4 /*!< I2C1 Alternate Function mapping       */
#define HAL_GPIO_AF4_I2C1_SCL            HAL_GPIO_AF_4 /*!< I2C1 Clock                            */
#define HAL_GPIO_AF4_I2C1_SDA            HAL_GPIO_AF_4 /*!< I2C1 Data                             */
#define HAL_GPIO_AF4_I2C1_SMBA           HAL_GPIO_AF_4 /*!< I2C1 SMBus Alert                      */
#define HAL_GPIO_AF4_I2C2                HAL_GPIO_AF_4 /*!< I2C2 Alternate Function mapping       */
#define HAL_GPIO_AF4_I2C2_SCL            HAL_GPIO_AF_4 /*!< I2C2 Clock                            */
#define HAL_GPIO_AF4_I2C2_SDA            HAL_GPIO_AF_4 /*!< I2C2 Data                             */
#define HAL_GPIO_AF4_I2C2_SMBA           HAL_GPIO_AF_4 /*!< I2C2 SMBus Alert                      */
#define HAL_GPIO_AF4_I2S3                HAL_GPIO_AF_4 /*!< I2S3 Alternate Function mapping       */
#define HAL_GPIO_AF4_I2S3_SCK            HAL_GPIO_AF_4 /*!< I2S3 Clock                            */
#define HAL_GPIO_AF4_I2S3_SDO            HAL_GPIO_AF_4 /*!< I2S3 Serial Data Output               */
#define HAL_GPIO_AF4_I3C1                HAL_GPIO_AF_4 /*!< I3C1 Alternate Function mapping       */
#define HAL_GPIO_AF4_I3C1_SCL            HAL_GPIO_AF_4 /*!< I3C1 Serial Clock                     */
#define HAL_GPIO_AF4_I3C1_SDA            HAL_GPIO_AF_4 /*!< I3C1 Serial Data                      */
#define HAL_GPIO_AF4_LPTIM1              HAL_GPIO_AF_4 /*!< LPTIM1 Alternate Function mapping     */
#define HAL_GPIO_AF4_LPTIM1_CH2          HAL_GPIO_AF_4 /*!< LPTIM1 Multi-purpose Channel 2        */
#define HAL_GPIO_AF4_SPI1                HAL_GPIO_AF_4 /*!< SPI1 Alternate Function mapping       */
#define HAL_GPIO_AF4_SPI1_RDY            HAL_GPIO_AF_4 /*!< SPI1 Master-In/Slave-Out FIFOs status */
#define HAL_GPIO_AF4_SPI3                HAL_GPIO_AF_4 /*!< SPI3 Alternate Function mapping       */
#define HAL_GPIO_AF4_SPI3_MOSI           HAL_GPIO_AF_4 /*!< SPI3 Master-Out/Slave-In              */
#define HAL_GPIO_AF4_SPI3_SCK            HAL_GPIO_AF_4 /*!< SPI3 Master-Out/Slave-In Clock        */
#define HAL_GPIO_AF4_TIM15               HAL_GPIO_AF_4 /*!< TIM15 Alternate Function mapping      */
#define HAL_GPIO_AF4_TIM15_BKIN          HAL_GPIO_AF_4 /*!< TIM15 Break input                     */
#define HAL_GPIO_AF4_TIM15_CH1           HAL_GPIO_AF_4 /*!< TIM15 Multi-purpose Channel 1         */
#define HAL_GPIO_AF4_TIM15_CH1N          HAL_GPIO_AF_4 /*!< TIM15 CH1 complementary output        */
#define HAL_GPIO_AF4_TIM15_CH2           HAL_GPIO_AF_4 /*!< TIM15 Multi-purpose Channel 2         */
#define HAL_GPIO_AF4_USART1              HAL_GPIO_AF_4 /*!< USART1 Alternate Function mapping     */
#define HAL_GPIO_AF4_USART1_RX           HAL_GPIO_AF_4 /*!< USART1 Serial Data Receive Input      */
#define HAL_GPIO_AF4_USART1_TX           HAL_GPIO_AF_4 /*!< USART1 Transmit Data Output           */
#define HAL_GPIO_AF4_USART2              HAL_GPIO_AF_4 /*!< USART2 Alternate Function mapping     */
#define HAL_GPIO_AF4_USART2_RX           HAL_GPIO_AF_4 /*!< USART2 Serial Data Receive Input      */
#define HAL_GPIO_AF4_USART2_TX           HAL_GPIO_AF_4 /*!< USART2 Transmit Data Output           */

/**
  * @brief   AF 5 selection
  */
#define HAL_GPIO_AF5_AUDIOCLK            HAL_GPIO_AF_5 /*!< Audio Clock                           */
#define HAL_GPIO_AF5_I2S1                HAL_GPIO_AF_5 /*!< I2S1 Alternate Function mapping       */
#define HAL_GPIO_AF5_I2S1_CK             HAL_GPIO_AF_5 /*!< I2S1 Serial Clock                     */
#define HAL_GPIO_AF5_I2S1_MCK            HAL_GPIO_AF_5 /*!< I2S1 Master Clock                     */
#define HAL_GPIO_AF5_I2S1_SDI            HAL_GPIO_AF_5 /*!< I2S1 Serial Data Input                */
#define HAL_GPIO_AF5_I2S1_SDO            HAL_GPIO_AF_5 /*!< I2S1 Serial Data Output               */
#define HAL_GPIO_AF5_I2S1_WS             HAL_GPIO_AF_5 /*!< I2S1 Word Select                      */
#define HAL_GPIO_AF5_I2S2                HAL_GPIO_AF_5 /*!< I2S2 Alternate Function mapping       */
#define HAL_GPIO_AF5_I2S2_CK             HAL_GPIO_AF_5 /*!< I2S2 Serial Clock                     */
#define HAL_GPIO_AF5_I2S2_MCK            HAL_GPIO_AF_5 /*!< I2S2 Master Clock                     */
#define HAL_GPIO_AF5_I2S2_SDI            HAL_GPIO_AF_5 /*!< I2S2 Serial Data Input                */
#define HAL_GPIO_AF5_I2S2_SDO            HAL_GPIO_AF_5 /*!< I2S2 Serial Data Output               */
#define HAL_GPIO_AF5_I2S2_WS             HAL_GPIO_AF_5 /*!< I2S2 Word Select                      */
#define HAL_GPIO_AF5_I2S3                HAL_GPIO_AF_5 /*!< I2S3 Alternate Function mapping       */
#define HAL_GPIO_AF5_I2S3_CK             HAL_GPIO_AF_5 /*!< I2S3 Serial Clock                     */
#define HAL_GPIO_AF5_I2S3_SDI            HAL_GPIO_AF_5 /*!< I2S3 Serial Data Input                */
#define HAL_GPIO_AF5_I2S3_SDO            HAL_GPIO_AF_5 /*!< I2S3 Serial Data Output               */
#define HAL_GPIO_AF5_I2S3_WS             HAL_GPIO_AF_5 /*!< I2S3 Word Select                      */
#define HAL_GPIO_AF5_I3C1                HAL_GPIO_AF_5 /*!< I3C1 Alternate Function mapping       */
#define HAL_GPIO_AF5_I3C1_SCL            HAL_GPIO_AF_5 /*!< I3C1 Clock                            */
#define HAL_GPIO_AF5_I3C1_SDA            HAL_GPIO_AF_5 /*!< I3C1 Data                             */
#define HAL_GPIO_AF5_LPTIM1              HAL_GPIO_AF_5 /*!< LPTIM1 Alternate Function mapping     */
#define HAL_GPIO_AF5_LPTIM1_CH1          HAL_GPIO_AF_5 /*!< LPTIM1 Multi-purpose Channel 1        */
#define HAL_GPIO_AF5_LPTIM1_IN1          HAL_GPIO_AF_5 /*!< LPTIM1 Channel 1 Input                */
#define HAL_GPIO_AF5_LPTIM1_IN2          HAL_GPIO_AF_5 /*!< LPTIM1 Channel 2 Input                */
#define HAL_GPIO_AF5_SPI1                HAL_GPIO_AF_5 /*!< SPI1 Alternate Function mapping       */
#define HAL_GPIO_AF5_SPI1_MISO           HAL_GPIO_AF_5 /*!< SPI1 Master-In/Slave-Out              */
#define HAL_GPIO_AF5_SPI1_MOSI           HAL_GPIO_AF_5 /*!< SPI1 Master-Out/Slave-In              */
#define HAL_GPIO_AF5_SPI1_NSS            HAL_GPIO_AF_5 /*!< SPI1 Slave Selection                  */
#define HAL_GPIO_AF5_SPI1_RDY            HAL_GPIO_AF_5 /*!< SPI1 Master-In/Slave-Out FIFOs status */
#define HAL_GPIO_AF5_SPI1_SCK            HAL_GPIO_AF_5 /*!< SPI1 Master-Out/Slave-In Clock        */
#define HAL_GPIO_AF5_SPI2                HAL_GPIO_AF_5 /*!< SPI2 Alternate Function mapping       */
#define HAL_GPIO_AF5_SPI2_MISO           HAL_GPIO_AF_5 /*!< SPI2 Master-In/Slave-Out              */
#define HAL_GPIO_AF5_SPI2_MOSI           HAL_GPIO_AF_5 /*!< SPI2 Master-Out/Slave-In              */
#define HAL_GPIO_AF5_SPI2_NSS            HAL_GPIO_AF_5 /*!< SPI2 Slave Selection                  */
#define HAL_GPIO_AF5_SPI2_RDY            HAL_GPIO_AF_5 /*!< SPI2 Master-In/Slave-Out FIFOs status */
#define HAL_GPIO_AF5_SPI2_SCK            HAL_GPIO_AF_5 /*!< SPI2 Master-Out/Slave-In Clock        */
#define HAL_GPIO_AF5_SPI3                HAL_GPIO_AF_5 /*!< SPI3 Alternate Function mapping       */
#define HAL_GPIO_AF5_SPI3_MISO           HAL_GPIO_AF_5 /*!< SPI3 Master-In/Slave-Out              */
#define HAL_GPIO_AF5_SPI3_MOSI           HAL_GPIO_AF_5 /*!< SPI3 Master-Out/Slave-In              */
#define HAL_GPIO_AF5_SPI3_NSS            HAL_GPIO_AF_5 /*!< SPI3 Slave Selection                  */
#define HAL_GPIO_AF5_SPI3_SCK            HAL_GPIO_AF_5 /*!< SPI3 Master-Out/Slave-In Clock        */

/**
  * @brief   AF 6 selection
  */
#define HAL_GPIO_AF6_I2S1                HAL_GPIO_AF_6 /*!< I2S1 Alternate Function mapping       */
#define HAL_GPIO_AF6_I2S1_SDO            HAL_GPIO_AF_6 /*!< I2S1 Serial Data Output               */
#define HAL_GPIO_AF6_I2S2                HAL_GPIO_AF_6 /*!< I2S2 Alternate Function mapping       */
#define HAL_GPIO_AF6_I2S2_CK             HAL_GPIO_AF_6 /*!< I2S2 Serial Clock                     */
#define HAL_GPIO_AF6_I2S2_SDI            HAL_GPIO_AF_6 /*!< I2S2 Serial Data Input                */
#define HAL_GPIO_AF6_I2S2_SDO            HAL_GPIO_AF_6 /*!< I2S2 Serial Data Output               */
#define HAL_GPIO_AF6_I2S3                HAL_GPIO_AF_6 /*!< I2S3 Alternate Function mapping       */
#define HAL_GPIO_AF6_I2S3_CK             HAL_GPIO_AF_6 /*!< I2S3 Serial Clock                     */
#define HAL_GPIO_AF6_I2S3_MCK            HAL_GPIO_AF_6 /*!< I2S3 Master Clock                     */
#define HAL_GPIO_AF6_I2S3_SDI            HAL_GPIO_AF_6 /*!< I2S3 Serial Data Input                */
#define HAL_GPIO_AF6_I2S3_SDO            HAL_GPIO_AF_6 /*!< I2S3 Serial Data Output               */
#define HAL_GPIO_AF6_I2S3_WS             HAL_GPIO_AF_6 /*!< I2S3 Word Select                      */
#define HAL_GPIO_AF6_SPI1                HAL_GPIO_AF_6 /*!< SPI1 Alternate Function mapping       */
#define HAL_GPIO_AF6_SPI1_MOSI           HAL_GPIO_AF_6 /*!< SPI1 Master-Out/Slave-In              */
#define HAL_GPIO_AF6_SPI2                HAL_GPIO_AF_6 /*!< SPI2 Alternate Function mapping       */
#define HAL_GPIO_AF6_SPI2_MISO           HAL_GPIO_AF_6 /*!< SPI2 Master-In/Slave-Out              */
#define HAL_GPIO_AF6_SPI2_MOSI           HAL_GPIO_AF_6 /*!< SPI2 Master-Out/Slave-In              */
#define HAL_GPIO_AF6_SPI2_SCK            HAL_GPIO_AF_6 /*!< SPI2 Master-Out/Slave-In Clock        */
#define HAL_GPIO_AF6_SPI3                HAL_GPIO_AF_6 /*!< SPI3 Alternate Function mapping       */
#define HAL_GPIO_AF6_SPI3_MISO           HAL_GPIO_AF_6 /*!< SPI3 Master-In/Slave-Out              */
#define HAL_GPIO_AF6_SPI3_MOSI           HAL_GPIO_AF_6 /*!< SPI3 Master-Out/Slave-In              */
#define HAL_GPIO_AF6_SPI3_NSS            HAL_GPIO_AF_6 /*!< SPI3 Slave Selection                  */
#define HAL_GPIO_AF6_SPI3_RDY            HAL_GPIO_AF_6 /*!< SPI3 Master-In/Slave-Out FIFOs status */
#define HAL_GPIO_AF6_SPI3_SCK            HAL_GPIO_AF_6 /*!< SPI3 Master-Out/Slave-In Clock        */
#define HAL_GPIO_AF6_UART4               HAL_GPIO_AF_6 /*!< UART4 Alternate Function mapping      */
#define HAL_GPIO_AF6_UART4_RX            HAL_GPIO_AF_6 /*!< UART4 Serial Data Receive Input       */
#define HAL_GPIO_AF6_UART4_TX            HAL_GPIO_AF_6 /*!< UART4 Transmit Data Output            */

/**
  * @brief   AF 7 selection
  */
#define HAL_GPIO_AF7_I2S2                HAL_GPIO_AF_7 /*!< I2S2 Alternate Function mapping       */
#define HAL_GPIO_AF7_I2S2_WS             HAL_GPIO_AF_7 /*!< I2S2 Word Select                      */
#define HAL_GPIO_AF7_I2S3                HAL_GPIO_AF_7 /*!< I2S3 Alternate Function mapping       */
#define HAL_GPIO_AF7_I2S3_SDO            HAL_GPIO_AF_7 /*!< I2S3 Serial Data Output               */
#define HAL_GPIO_AF7_SPI2                HAL_GPIO_AF_7 /*!< SPI2 Alternate Function mapping       */
#define HAL_GPIO_AF7_SPI2_NSS            HAL_GPIO_AF_7 /*!< SPI2 Slave Selection                  */
#define HAL_GPIO_AF7_SPI2_RDY            HAL_GPIO_AF_7 /*!< SPI2 Master-In/Slave-Out FIFOs status */
#define HAL_GPIO_AF7_SPI3                HAL_GPIO_AF_7 /*!< SPI3 Alternate Function mapping       */
#define HAL_GPIO_AF7_SPI3_MOSI           HAL_GPIO_AF_7 /*!< SPI3 Master-Out/Slave-In              */
#define HAL_GPIO_AF7_USART1              HAL_GPIO_AF_7 /*!< USART1 Alternate Function mapping     */
#define HAL_GPIO_AF7_USART1_CK           HAL_GPIO_AF_7 /*!< USART1 Clock                          */
#define HAL_GPIO_AF7_USART1_CTS          HAL_GPIO_AF_7 /*!< USART1 Clear to send                  */
#define HAL_GPIO_AF7_USART1_NSS          HAL_GPIO_AF_7 /*!< USART1 Slave Selection                */
#define HAL_GPIO_AF7_USART1_RTS          HAL_GPIO_AF_7 /*!< USART1 Request to send                */
#define HAL_GPIO_AF7_USART1_RTS_DE       HAL_GPIO_AF7_USART1_RTS /*!< Alias to USART1_RTS         */
#define HAL_GPIO_AF7_USART1_RX           HAL_GPIO_AF_7 /*!< USART1 Serial Data Receive Input      */
#define HAL_GPIO_AF7_USART1_TX           HAL_GPIO_AF_7 /*!< USART1 Transmit Data Output           */
#define HAL_GPIO_AF7_USART2              HAL_GPIO_AF_7 /*!< USART2 Alternate Function mapping     */
#define HAL_GPIO_AF7_USART2_CK           HAL_GPIO_AF_7 /*!< USART2 Clock                          */
#define HAL_GPIO_AF7_USART2_CTS          HAL_GPIO_AF_7 /*!< USART2 Clear to send                  */
#define HAL_GPIO_AF7_USART2_NSS          HAL_GPIO_AF_7 /*!< USART2 Slave Selection                */
#define HAL_GPIO_AF7_USART2_RTS          HAL_GPIO_AF_7 /*!< USART2 Request to send                */
#define HAL_GPIO_AF7_USART2_RTS_DE       HAL_GPIO_AF7_USART2_RTS /*!< Alias to USART2_RTS         */
#define HAL_GPIO_AF7_USART2_RX           HAL_GPIO_AF_7 /*!< USART2 Serial Data Receive Input      */
#define HAL_GPIO_AF7_USART2_TX           HAL_GPIO_AF_7 /*!< USART2 Transmit Data Output           */
#define HAL_GPIO_AF7_USART3              HAL_GPIO_AF_7 /*!< USART3 Alternate Function mapping     */
#define HAL_GPIO_AF7_USART3_CK           HAL_GPIO_AF_7 /*!< USART3 Clock                          */
#define HAL_GPIO_AF7_USART3_CTS          HAL_GPIO_AF_7 /*!< USART3 Clear to send                  */
#define HAL_GPIO_AF7_USART3_NSS          HAL_GPIO_AF_7 /*!< USART3 Slave Selection                */
#define HAL_GPIO_AF7_USART3_RTS          HAL_GPIO_AF_7 /*!< USART3 Request to send                */
#define HAL_GPIO_AF7_USART3_RTS_DE       HAL_GPIO_AF7_USART3_RTS /*!< Alias to USART3_RTS         */
#define HAL_GPIO_AF7_USART3_RX           HAL_GPIO_AF_7 /*!< USART3 Serial Data Receive Input      */
#define HAL_GPIO_AF7_USART3_TX           HAL_GPIO_AF_7 /*!< USART3 Transmit Data Output           */

