MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_gpio.h
/**
  * @brief   AF 6 selection
  */
#define HAL_GPIO_AF6_FDCAN2              HAL_GPIO_AF_6 /*!< FDCAN2 Alternate Function mapping     */
#define HAL_GPIO_AF6_FDCAN2_RX           HAL_GPIO_AF_6 /*!< FDCAN2 Receive pin                    */
#define HAL_GPIO_AF6_FDCAN2_TX           HAL_GPIO_AF_6 /*!< FDCAN2 Transmit pin                   */
#define HAL_GPIO_AF6_I2S1                HAL_GPIO_AF_6 /*!< I2S1 Alternate Function mapping       */
#define HAL_GPIO_AF6_I2S1_CK             HAL_GPIO_AF_6 /*!< I2S1 Serial Clock                     */
#define HAL_GPIO_AF6_I2S1_MCK            HAL_GPIO_AF_6 /*!< I2S1 Master Clock                     */
#define HAL_GPIO_AF6_I2S1_SDI            HAL_GPIO_AF_6 /*!< I2S1 Serial Data Input                */
#define HAL_GPIO_AF6_I2S1_SDO            HAL_GPIO_AF_6 /*!< I2S1 Serial Data Output               */
#define HAL_GPIO_AF6_I2S1_WS             HAL_GPIO_AF_6 /*!< I2S1 Word Select                      */
#define HAL_GPIO_AF6_I2S2                HAL_GPIO_AF_6 /*!< I2S2 Alternate Function mapping       */
#define HAL_GPIO_AF6_I2S2_CK             HAL_GPIO_AF_6 /*!< I2S2 Serial Clock                     */
#define HAL_GPIO_AF6_I2S2_SDI            HAL_GPIO_AF_6 /*!< I2S2 Serial Data Input                */
#define HAL_GPIO_AF6_I2S2_SDO            HAL_GPIO_AF_6 /*!< I2S2 Serial Data Output               */
#define HAL_GPIO_AF6_I2S2_WS             HAL_GPIO_AF_6 /*!< I2S2 Word Select                      */
#define HAL_GPIO_AF6_SPI1                HAL_GPIO_AF_6 /*!< SPI1 Alternate Function mapping       */
#define HAL_GPIO_AF6_SPI1_MISO           HAL_GPIO_AF_6 /*!< SPI1 Master-In/Slave-Out              */
#define HAL_GPIO_AF6_SPI1_MOSI           HAL_GPIO_AF_6 /*!< SPI1 Master-Out/Slave-In              */
#define HAL_GPIO_AF6_SPI1_NSS            HAL_GPIO_AF_6 /*!< SPI1 Slave Selection                  */
#define HAL_GPIO_AF6_SPI1_RDY            HAL_GPIO_AF_6 /*!< SPI1 Master-In/Slave-Out FIFOs status */
#define HAL_GPIO_AF6_SPI1_SCK            HAL_GPIO_AF_6 /*!< SPI1 Master-Out/Slave-In Clock        */
#define HAL_GPIO_AF6_SPI2                HAL_GPIO_AF_6 /*!< SPI2 Alternate Function mapping       */
#define HAL_GPIO_AF6_SPI2_MISO           HAL_GPIO_AF_6 /*!< SPI2 Master-In/Slave-Out              */
#define HAL_GPIO_AF6_SPI2_MOSI           HAL_GPIO_AF_6 /*!< SPI2 Master-Out/Slave-In              */
#define HAL_GPIO_AF6_SPI2_NSS            HAL_GPIO_AF_6 /*!< SPI2 Slave Selection                  */
#define HAL_GPIO_AF6_SPI2_SCK            HAL_GPIO_AF_6 /*!< SPI2 Master-Out/Slave-In Clock        */
#define HAL_GPIO_AF6_UART4               HAL_GPIO_AF_6 /*!< UART4 Alternate Function mapping      */
#define HAL_GPIO_AF6_UART4_RX            HAL_GPIO_AF_6 /*!< UART4 Serial Data Receive Input       */
#define HAL_GPIO_AF6_UART4_TX            HAL_GPIO_AF_6 /*!< UART4 Transmit Data Output            */

/**
  * @brief   AF 7 selection
  */
#define HAL_GPIO_AF7_I2S2                HAL_GPIO_AF_7 /*!< I2S2 Alternate Function mapping       */
#define HAL_GPIO_AF7_I2S2_SDO            HAL_GPIO_AF_7 /*!< I2S2 Serial Data Output               */
#define HAL_GPIO_AF7_I2S2_WS             HAL_GPIO_AF_7 /*!< I2S2 Word Select                      */
#define HAL_GPIO_AF7_SPI2                HAL_GPIO_AF_7 /*!< SPI2 Alternate Function mapping       */
#define HAL_GPIO_AF7_SPI2_MOSI           HAL_GPIO_AF_7 /*!< SPI2 Master-Out/Slave-In              */
#define HAL_GPIO_AF7_SPI2_NSS            HAL_GPIO_AF_7 /*!< SPI2 Slave Selection                  */
#define HAL_GPIO_AF7_SPI2_RDY            HAL_GPIO_AF_7 /*!< SPI2 Master-In/Slave-Out FIFOs status */
#define HAL_GPIO_AF7_USART1              HAL_GPIO_AF_7 /*!< USART1 Alternate Function mapping     */
#define HAL_GPIO_AF7_USART1_CK           HAL_GPIO_AF_7 /*!< USART1 Clock                          */
#define HAL_GPIO_AF7_USART1_CTS          HAL_GPIO_AF_7 /*!< USART1 Clear to send                  */
#define HAL_GPIO_AF7_USART1_NSS          HAL_GPIO_AF_7 /*!< USART1 Slave Selection                */
#define HAL_GPIO_AF7_USART1_RTS          HAL_GPIO_AF_7 /*!< USART1 Request to send                */
#define HAL_GPIO_AF7_USART1_RTS_DE       HAL_GPIO_AF7_USART1_RTS /*!< Alias to USART1_RTS          */
#define HAL_GPIO_AF7_USART1_RX           HAL_GPIO_AF_7 /*!< USART1 Serial Data Receive Input      */
#define HAL_GPIO_AF7_USART1_TX           HAL_GPIO_AF_7 /*!< USART1 Transmit Data Output           */
#define HAL_GPIO_AF7_USART2              HAL_GPIO_AF_7 /*!< USART2 Alternate Function mapping     */
#define HAL_GPIO_AF7_USART2_CK           HAL_GPIO_AF_7 /*!< USART2 Clock                          */
#define HAL_GPIO_AF7_USART2_CTS          HAL_GPIO_AF_7 /*!< USART2 Clear to send                  */
#define HAL_GPIO_AF7_USART2_NSS          HAL_GPIO_AF_7 /*!< USART2 Slave Selection                */
#define HAL_GPIO_AF7_USART2_RTS          HAL_GPIO_AF_7 /*!< USART2 Request to send                */
#define HAL_GPIO_AF7_USART2_RTS_DE       HAL_GPIO_AF7_USART2_RTS /*!< Alias to USART2_RTS         */
#define HAL_GPIO_AF7_USART2_RX           HAL_GPIO_AF_7 /*!< USART2 Serial Data Receive Input      */
#define HAL_GPIO_AF7_USART2_TX           HAL_GPIO_AF_7 /*!< USART2 Transmit Data Output           */

/**
  * @brief   AF 8 selection
  */
#define HAL_GPIO_AF8_I2C1                HAL_GPIO_AF_8 /*!< I2C1 Alternate Function mapping      */
#define HAL_GPIO_AF8_I2C1_SCL            HAL_GPIO_AF_8 /*!< I2C1 Clock                           */
#define HAL_GPIO_AF8_I2C1_SDA            HAL_GPIO_AF_8 /*!< I2C1 Data                            */
#define HAL_GPIO_AF8_LPUART1             HAL_GPIO_AF_8 /*!< LPUART1 Alternate Function mapping   */
#define HAL_GPIO_AF8_LPUART1_CTS         HAL_GPIO_AF_8 /*!< LPUART1 Clear to send                */
#define HAL_GPIO_AF8_LPUART1_RTS         HAL_GPIO_AF_8 /*!< LPUART1 Request to send              */
#define HAL_GPIO_AF8_LPUART1_RTS_DE      HAL_GPIO_AF8_LPUART1_RTS /*!< Alias to LPUART1_RTS      */
#define HAL_GPIO_AF8_LPUART1_RX          HAL_GPIO_AF_8 /*!< LPUART1 Serial Data Receive Input    */
#define HAL_GPIO_AF8_LPUART1_TX          HAL_GPIO_AF_8 /*!< LPUART1 Transmit Data Output         */
#define HAL_GPIO_AF8_UART4               HAL_GPIO_AF_8 /*!< UART4 Alternate Function mapping     */
#define HAL_GPIO_AF8_UART4_CTS           HAL_GPIO_AF_8 /*!< UART4 Clear to send                  */
#define HAL_GPIO_AF8_UART4_RTS           HAL_GPIO_AF_8 /*!< UART4 Request to send                */
#define HAL_GPIO_AF8_UART4_RTS_DE        HAL_GPIO_AF8_UART4_RTS /*!< Alias to UART4_RTS          */
#define HAL_GPIO_AF8_UART4_RX            HAL_GPIO_AF_8 /*!< UART4 Serial Data Receive Input      */
#define HAL_GPIO_AF8_UART4_TX            HAL_GPIO_AF_8 /*!< UART4 Transmit Data Output           */
#define HAL_GPIO_AF8_UART5               HAL_GPIO_AF_8 /*!< UART5 Alternate Function mapping     */
#define HAL_GPIO_AF8_UART5_CTS           HAL_GPIO_AF_8 /*!< UART5 Clear to send                  */
#define HAL_GPIO_AF8_UART5_RTS           HAL_GPIO_AF_8 /*!< UART5 Request to send                */
#define HAL_GPIO_AF8_UART5_RTS_DE        HAL_GPIO_AF8_UART5_RTS /*!< Alias to UART5_RTS          */
#define HAL_GPIO_AF8_UART5_RX            HAL_GPIO_AF_8 /*!< UART5 Serial Data Receive Input      */
#define HAL_GPIO_AF8_UART5_TX            HAL_GPIO_AF_8 /*!< UART5 Transmit Data Output           */

/**
  * @brief   AF 9 selection
  */
#define HAL_GPIO_AF9_FDCAN1              HAL_GPIO_AF_9 /*!< FDCAN1 Alternate Function mapping    */
#define HAL_GPIO_AF9_FDCAN1_RX           HAL_GPIO_AF_9 /*!< FDCAN1 Receive pin                   */
#define HAL_GPIO_AF9_FDCAN1_TX           HAL_GPIO_AF_9 /*!< FDCAN1 Transmit pin                  */
#define HAL_GPIO_AF9_FDCAN2              HAL_GPIO_AF_9 /*!< FDCAN2 Alternate Function mapping    */
#define HAL_GPIO_AF9_FDCAN2_RX           HAL_GPIO_AF_9 /*!< FDCAN2 Receive pin                   */
#define HAL_GPIO_AF9_FDCAN2_TX           HAL_GPIO_AF_9 /*!< FDCAN2 Transmit pin                  */
#define HAL_GPIO_AF9_I2C1                HAL_GPIO_AF_9 /*!< I2C1 Alternate Function mapping      */
#define HAL_GPIO_AF9_I2C1_SCL            HAL_GPIO_AF_9 /*!< I2C1 Clock                           */
#define HAL_GPIO_AF9_I2C1_SDA            HAL_GPIO_AF_9 /*!< I2C1 Data                            */
#define HAL_GPIO_AF9_I2C1_SMBA           HAL_GPIO_AF_9 /*!< I2C1 SMBus Alert                     */
#define HAL_GPIO_AF9_I2S2                HAL_GPIO_AF_9 /*!< I2S2 Alternate Function mapping      */
#define HAL_GPIO_AF9_I2S2_WS             HAL_GPIO_AF_9 /*!< I2S2 Word Select                     */
#define HAL_GPIO_AF9_SPI2                HAL_GPIO_AF_9 /*!< SPI2 Alternate Function mapping      */
#define HAL_GPIO_AF9_SPI2_NSS            HAL_GPIO_AF_9 /*!< SPI2 Slave Selection                 */

/**
  * @brief   AF 10 selection
  */
#define HAL_GPIO_AF10_CRS                HAL_GPIO_AF_10 /*!< CRS Alternate Function mapping      */
#define HAL_GPIO_AF10_CRS_SYNC           HAL_GPIO_AF_10 /*!< CRS synchronization                 */

/**
  * @brief   AF 11 selection
  */
#define HAL_GPIO_AF11_USART1             HAL_GPIO_AF_11 /*!< USART1 Alternate Function mapping   */
#define HAL_GPIO_AF11_USART1_CK          HAL_GPIO_AF_11 /*!< USART1 Clock                        */
#define HAL_GPIO_AF11_USART1_CTS         HAL_GPIO_AF_11 /*!< USART1 Clear to send                */
#define HAL_GPIO_AF11_USART1_NSS         HAL_GPIO_AF_11 /*!< USART1 Slave Selection              */
#define HAL_GPIO_AF11_USART1_RTS         HAL_GPIO_AF_11 /*!< USART1 Request to send              */
#define HAL_GPIO_AF11_USART1_RX          HAL_GPIO_AF_11 /*!< USART1 Serial Data Receive Input    */
#define HAL_GPIO_AF11_USART1_TX          HAL_GPIO_AF_11 /*!< USART1 Transmit Data Output         */

/**
  * @brief   AF 13 selection
  */
#define HAL_GPIO_AF13_TIM8               HAL_GPIO_AF_13 /*!< TIM8 Alternate Function mapping     */
#define HAL_GPIO_AF13_TIM8_CH1           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 1        */
#define HAL_GPIO_AF13_TIM8_CH2           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 2        */
#define HAL_GPIO_AF13_TIM8_CH2N          HAL_GPIO_AF_13 /*!< TIM8 CH2 complementary output       */
#define HAL_GPIO_AF13_TIM8_CH3           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 3        */
#define HAL_GPIO_AF13_TIM8_CH4           HAL_GPIO_AF_13 /*!< TIM8 Multi-purpose Channel 4        */
#define HAL_GPIO_AF13_TIM8_CH4N          HAL_GPIO_AF_13 /*!< TIM8 CH4 complementary output       */
#define HAL_GPIO_AF13_USB                HAL_GPIO_AF_13 /*!< USB Alternate Function mapping      */
#define HAL_GPIO_AF13_USB_SOF            HAL_GPIO_AF_13 /*!< USB Start of Frame                  */

/**
  * @brief   AF 14 selection
  */
#define HAL_GPIO_AF14_COMP1              HAL_GPIO_AF_14 /*!< COMP1 Alternate Function mapping    */
#define HAL_GPIO_AF14_COMP1_OUT          HAL_GPIO_AF_14 /*!< COMP1 Output channel                */
#define HAL_GPIO_AF14_COMP2              HAL_GPIO_AF_14 /*!< COMP2 Alternate Function mapping    */
#define HAL_GPIO_AF14_COMP2_OUT          HAL_GPIO_AF_14 /*!< COMP2 Output channel                */
#define HAL_GPIO_AF14_TIM2               HAL_GPIO_AF_14 /*!< TIM2 Alternate Function mapping     */
#define HAL_GPIO_AF14_TIM2_CH4           HAL_GPIO_AF_14 /*!< TIM2 Multi-purpose Channel 4        */
#define HAL_GPIO_AF14_TIM2_ETR           HAL_GPIO_AF_14 /*!< TIM2 External trigger input         */
#define HAL_GPIO_AF14_UART5              HAL_GPIO_AF_14 /*!< UART5 Alternate Function mapping    */
#define HAL_GPIO_AF14_UART5_CTS          HAL_GPIO_AF_14 /*!< UART5 Clear to send                 */
#define HAL_GPIO_AF14_UART5_RTS          HAL_GPIO_AF_14 /*!< UART5 Request to send               */
#define HAL_GPIO_AF14_UART5_RTS_DE       HAL_GPIO_AF14_UART5_RTS /*!< Alias to UART5_RTS         */
#define HAL_GPIO_AF14_UART5_RX           HAL_GPIO_AF_14 /*!< UART5 Serial Data Receive Input     */
#define HAL_GPIO_AF14_UART5_TX           HAL_GPIO_AF_14 /*!< UART5 Transmit Data Output          */

/**
  * @brief   AF 15 selection
  */
#define HAL_GPIO_AF15_EVENTOUT           HAL_GPIO_AF_15 /*!< EVENTOUT Alternate Function mapping */
#endif /* STM32C531xx || STM32C532xx || STM32C542xx */
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Exported_Functions HAL GPIO Functions
  * @{
  */

/** @defgroup GPIO_Exported_Functions_Group1 Initialization/de-initialization functions
  * @{
  */

hal_status_t  HAL_GPIO_Init(hal_gpio_t gpiox, uint32_t pins, const hal_gpio_config_t *p_config);
void          HAL_GPIO_DeInit(hal_gpio_t  gpiox, uint32_t pins);

/**
  * @}
  */

/** @defgroup GPIO_Exported_Functions_Group2 IO operation functions
  * @{
  */

hal_gpio_pin_state_t HAL_GPIO_ReadPin(hal_gpio_t gpiox, uint32_t pin);
void HAL_GPIO_WritePin(hal_gpio_t gpiox, uint32_t pins, hal_gpio_pin_state_t pin_state);
void HAL_GPIO_WriteMultipleStatePin(hal_gpio_t gpiox, uint32_t pins_reset, uint32_t pins_set);
void HAL_GPIO_TogglePin(hal_gpio_t gpiox, uint32_t pins);
hal_status_t HAL_GPIO_LockPin(hal_gpio_t gpiox, uint32_t pins);
GPIO_TypeDef *HAL_GPIO_GetLLInstance(hal_gpio_t gpiox);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* GPIOA || GPIOB || GPIOC || GPIOD || GPIOE || GPIOF || GPIOG || GPIOH */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_HAL_GPIO_H */
